org/web/Firefox.org
* Firefox
** Firefox ポータブル

   個人のfirefox設定などを持ち運ぶことができる。

   USB に入れて持ち運べば，家でも続きができて，便利。

   自分のフォルダに入れて使えば，設定や履歴がいつまでも消えずに残こっ
   ていて，便利。

** 準備

1. 「生徒用サーバ」の「情報処理鈴木2015のフォルダ」の「講義用アプリ」を開く。
2. 中の *Firefox Portable* フォルダを右クリックし，*コピー* を選ぶ。
3. USB や *自分のフォルダ* の中の使い易いフォルダを開く。
4. フォルダを右クリックして，*貼り付け*を選び，コピーする。

** Firefoxを動かす

  - 「FirefoxPortable」フォルダの中の
    - あれば，*FireFox* を *ダブルクリック*
    - なければ「App」 フォルダの中の
      - 「Firefox64」フォルダの中の
	- *firefox* を *ダブルクリック* (こいつがアプリ本体)

** ショートカットを作る

- firefox を右クリックして，ショートカットを作り，
- そのショートカットをカットし，
- すぐに使えるフォルダにいって「貼り付」ける
- 以後，そのショートカットをダブルクリックすれば，firefox を動かせる。

** はじめての Firefox | Firefox ヘルプ

   [[https://support.mozilla.org/ja/kb/get-started-firefox-overview-main-features][はじめての Firefox]] を読んで使い方を知りましょう。









   



