org/firefox.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<title>情報処理応用 Firefox</title>
<!-- 2016-11-16 水 21:21 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="masayuki" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://wiki.cis.iwate-u.ac.jp/~suzuki/org-html-theme/styles/sos/css/sos.css">
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">情報処理応用 Firefox</h1>
<div id="table-of-contents">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Firefox</a>
<ul>
<li><a href="#sec-1-1">1.1. Firefox ポータブル</a></li>
<li><a href="#sec-1-2">1.2. 準備</a></li>
<li><a href="#sec-1-3">1.3. Firefoxを動かす</a></li>
<li><a href="#sec-1-4">1.4. ショートカットを作る</a></li>
<li><a href="#sec-1-5">1.5. はじめての Firefox | Firefox ヘルプ</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="http://masayuki054.hatenablog.com/entries/2016/09/20">ポータル</a> /
<a href="http://masayuki054.github.io/morioka_u_ict">ホーム</a> / 
<a href="https://github.com/masayuki054/morioka_u_ict/blob/master/%E8%AC%9B%E7%BE%A9%E4%B8%AD%E3%81%AE%E3%81%8A%E7%9F%A5%E3%82%89%E3%81%9B.org">講義中のお知らせ</a>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Firefox</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Firefox ポータブル</h3>
<div class="outline-text-3" id="text-1-1">
<p>
個人のfirefox設定などを持ち運ぶことができる。
</p>

<p>
USB に入れて持ち運べば，家でも続きができて，便利。
</p>

<p>
自分のフォルダに入れて使えば，設定や履歴がいつまでも消えずに残こっ
ていて，便利。
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 準備</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>「生徒用サーバ」の「情報処理鈴木2015のフォルダ」の「講義用アプリ」を開く。
</li>
<li>中の <b>Firefox Portable</b> フォルダを右クリックし，*コピー* を選ぶ。
</li>
<li>USB や <b>自分のフォルダ</b> の中の使い易いフォルダを開く。
</li>
<li>フォルダを右クリックして，*貼り付け*を選び，コピーする。
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Firefoxを動かす</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>「FirefoxPortable」フォルダの中の
<ul class="org-ul">
<li>あれば，*FireFox* を <b>ダブルクリック</b>
</li>
<li>なければ「App」 フォルダの中の
<ul class="org-ul">
<li>「Firefox64」フォルダの中の
<ul class="org-ul">
<li><b>firefox</b> を <b>ダブルクリック</b> (こいつがアプリ本体)
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> ショートカットを作る</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>firefox を右クリックして，ショートカットを作り，
</li>
<li>そのショートカットをカットし，
</li>
<li>すぐに使えるフォルダにいって「貼り付」ける
</li>
<li>以後，そのショートカットをダブルクリックすれば，firefox を動かせる。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> はじめての Firefox | Firefox ヘルプ</h3>
<div class="outline-text-3" id="text-1-5">
<p>
<a href="https://support.mozilla.org/ja/kb/get-started-firefox-overview-main-features">はじめての Firefox</a> を読んで使い方を知りましょう。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: masayuki</p>
<p class="date">Created: 2016-11-16 水 21:21</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
